garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1578.PIC
        <edc:SFRDef edc:access="nn--nnn-" edc:cname="CWG1CON2" edc:desc="" edc:impl="0xce" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu--uuu-" edc:name="CWG1CON2" edc:nzwidth="8" edc:por="xx--xxx-" edc:_modsrc="DOS-01488_A4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x695">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDSPPS" edc:desc="" edc:mask="0x1" edc:name="G1ASDSPPS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDSC1" edc:desc="" edc:mask="0x1" edc:name="G1ASDSC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDSC2" edc:desc="" edc:mask="0x1" edc:name="G1ASDSC2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="G1ARSEN" edc:desc="" edc:mask="0x1" edc:name="G1ARSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASE" edc:desc="" edc:mask="0x1" edc:name="G1ASE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="14" edc:beginaddr="0x700" edc:endaddr="0x720" edc:regionid="sfr14">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x700"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="15" edc:beginaddr="0x780" edc:endaddr="0x7a0" edc:regionid="sfr15">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x780"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="16" edc:beginaddr="0x800" edc:endaddr="0x820" edc:regionid="sfr16">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x800"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="17" edc:beginaddr="0x880" edc:endaddr="0x8a0" edc:regionid="sfr17">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x880"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="18" edc:beginaddr="0x900" edc:endaddr="0x920" edc:regionid="sfr18">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x900"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="19" edc:beginaddr="0x980" edc:endaddr="0x9a0" edc:regionid="sfr19">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x980"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="20" edc:beginaddr="0xa00" edc:endaddr="0xa20" edc:regionid="sfr20">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xA00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="21" edc:beginaddr="0xa80" edc:endaddr="0xaa0" edc:regionid="sfr21">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xA80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="22" edc:beginaddr="0xb00" edc:endaddr="0xb20" edc:regionid="sfr22">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xB00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="23" edc:beginaddr="0xb80" edc:endaddr="0xba0" edc:regionid="sfr23">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xB80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="24" edc:beginaddr="0xc00" edc:endaddr="0xc20" edc:regionid="sfr24">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xC00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="25" edc:beginaddr="0xc80" edc:endaddr="0xca0" edc:regionid="sfr25">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xC80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="26" edc:beginaddr="0xd00" edc:endaddr="0xd20" edc:regionid="sfr26">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xD00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="27" edc:beginaddr="0xd80" edc:endaddr="0xdf0" edc:regionid="sfr27">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xD80"/>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0xD8C"/>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PWMEN" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWMEN" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xD8E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM1EN_A" edc:desc="" edc:mask="0x1" edc:name="PWM1EN_A" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2EN_A" edc:desc="" edc:mask="0x1" edc:name="PWM2EN_A" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3EN_A" edc:desc="" edc:mask="0x1" edc:name="PWM3EN_A" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4EN_A" edc:desc="" edc:mask="0x1" edc:name="PWM4EN_A" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MPWM1EN" edc:desc="" edc:mask="0x1" edc:name="MPWM1EN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MPWM2EN" edc:desc="" edc:mask="0x1" edc:name="MPWM2EN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MPWM3EN" edc:desc="" edc:mask="0x1" edc:name="MPWM3EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PWMLD" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWMLD" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xD8F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM1LDA_A" edc:desc="" edc:mask="0x1" edc:name="PWM1LDA_A" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2LDA_A" edc:desc="" edc:mask="0x1" edc:name="PWM2LDA_A" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3LDA_A" edc:desc="" edc:mask="0x1" edc:name="PWM3LDA_A" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4LDA_A" edc:desc="" edc:mask="0x1" edc:name="PWM4LDA_A" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MPWM1LD" edc:desc="" edc:mask="0x1" edc:name="MPWM1LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MPWM2LD" edc:desc="" edc:mask="0x1" edc:name="MPWM2LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MPWM3LD" edc:desc="" edc:mask="0x1" edc:name="MPWM3LD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
